//////////类型分类：
//////////整形家族
////////char
////////unsigned char               //char是signed char还是unsigned char 不确定
////////signed char                   //char在vs上是signed char
////////short
////////unsigned short[int]            //short =signed short
////////signed short[int]
////////int
////////unsigned int                        //   int ==    signed int     
////////signed  int
////////long
////////unsigned long[int]
////////signed long[int]
////////浮点数家族
////////float
////////double
////////
////////自定义类型
////////数组类型
////////注意：	int arr1[10]; -> int[10]
////////int arr2[5];  -> int[5]
////////两者是不同类型
////////结构体类型  struct
////////枚举类型  enum
////////联合类型  union
////////指针类型
////////int* pi;
////////char* pc;
////////float* pf;
////////void* pv;
////////结构体指针
////////空类型
////////void表示空类型（无类型）。通常用于函数的返回类型、函数的参数、指针类型。
//////
//////
//////
//////int main() {
//////	char a1 = -128;
//////	// - 128
//////	//原码1000 0000 0000 0000 0000 0000 1000 0000
//////	//反码1111 1111 1111 1111 1111 1111 0111 1111 
//////	//补码1111 1111 1111 1111 1111 1111 1000 0000
//////	//整型截断得 1000 0000
//////	//由于%u是打印无符号十进制整形，我们可以直接将补码看成原码
//////	//1111 1111 1111 1111 1111 1111 1000 0000
//////
//////	printf("(char)-128 = %u\n", a1);   //输出(char)-128 = 4294967168
//////
//////	char a2 = 128;
//////	//128的原码0000 0000 0000 0000 0000 0000 1000 0000
//////	// 截断后得 1000 0000
//////	//补：1111 1111 1111 1111 1111 1111 1000 0000
//////	// 但由于需要打印无符号十进制数，我们可以直接将补码看成原码
//////	//整型截断得 1000 0000
//////	//整型提升 1111 1111 1111 1111 1111 1111 1000 0000
//////	//由于%u是打印无符号十进制整形，我们可以直接将补码看成原码
//////	//1111 1111 1111 1111 1111 1111 1000 0000
//////
//////	printf("(char)128 = %u\n", a2);  //输出(char)128 = 4294967168
//////	return 0;
//////}
////
////
////int main() {
////	char a = -1;
////	//在内存中存储的补码1000 0000 0000 0000 0000 0000 0000 0001
////	// 1111 1111 1111 1111 1111 1111 1111 1110
////	// 1111 1111 1111 1111 1111 1111 1111 1111
////	//截断得 到得内存中存储的为 1111 1111
////
////	//a的整型提升：
////	/*
////	内存中的补码1111 1111 1111 1111 1111 1111 1111 1111
////	1000 0000 0000 0000 0000 0000 0000 0000
////	得到的原码1000 0000 0000 0000 0000 0000 0000 0001
////	即输出 -1
////	*/
////	signed char a1 = -1;
////	unsigned char a2 = -1;
////	//1111 1111
////	//a2的整型提升
////	//0000 0000 0000 0000 0000 0000 1111 1111
////	printf("a = %d , a1 = %d , a2 = %d\n", a, a1, a2);//a = -1 , a1 = -1 , a2 = 255
////	//%d 打印需要进行整型提升
////	return 0;
////}
//
//
////代码1
//int main() {
//	int a = 1;
//	//if (*(char*)&a == 1) printf("小端");
//	//else printf("大端");
//
//	int* pa = &a;
//	char* p = (int*)pa;
//	if (*p == 1) printf("小端");
//	else printf("大端");
//
//	return 0;
//}
//
////代码2
//int check_sys() {
//	int a = 1;
//	//if (*(char*)&a == 1)return 1;
//	//else return 0;
//	return *(char*)&a;
//}
//int main() {
//	int ret = check_sys();
//	if (ret == 1) printf("小端");
//	else printf("大端");
//	return 0;
//}
//
//
