#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//int main()
//{
//	//int r = 7 / 2;
//	//printf("%d\n", r);
//	//double d = 7 / 2;
//	//printf("%lf\n", d);//3.5?
//
//
//	double d = 7.0 / 2.0;
//	printf("%lf\n", d);//3.5?
//
//	return 0;
//}

//int main()
//{
//	int n = 0;
//	int r = 5 / n;
//	return 0;
//}


//int main()
//{
//	int r = 15 % 8;//% 得到是整除后的余数
//	printf("%d\n", r);
//	return 0;
//}


//int main()
//{
//	int a = 15;
//	int b = a >> 1;//移动就是a中的2进制信息
//
//	return 0;
//}

//int main()
//{
//	int a = 15;
//	//00000000000000000000000000001111 - 原码
//	//00000000000000000000000000001111 - 反码
//	//00000000000000000000000000001111 - 补码
//
//	int b = -15;
//	//10000000000000000000000000001111 - 原码
//	//11111111111111111111111111110000 - 反码(原码的符号位不变，其他位按位取反得到的就是反码)
//	//11111111111111111111111111110001 - 补码(反码+1就是补码)
//	
//	//整数在内存中存储的是补码
//	//计算的时候也是使用补码计算的
//	return 0;
//}

//移位移动的是补码的二进制序列
//int main()
//{
//	int a = 15;
//	int b = a >> 1;
//	printf("%d\n", b);//7
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = -15;
//	int b = a >> 1;
//	printf("%d\n", b);
//	printf("%d\n", a);
//	return 0;
//}
//

//int main()
//{
//	int a = 6;
//	//左移操作符 - 左边丢弃，右边补0
//	//[00000000000000000000000000000110] - 6的补码
//	//[00000000000000000000000000001100] - 补码
//	//
//	/*int b = a << 1;
//	printf("%d\n", b);
//	printf("%d\n", a);*/
//
//	//a = a << 1;
//	//a <<= 1;
//	//a = a + 1;
//	//a += 1;
//
//	return 0;
//}


//int main()
//{
//	int a = 5;
//	int b = a >> -2;//标准未定义行为
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011 - 补码
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 - 补码
//	//
//	int c = a & b;
//	//& -- 对应二进制位有0则为0，两个同时为1，才是1
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//00000000000000000000000000000011 - 补码
//	//
//	printf("%d\n", c);//3
//
//	return 0;
//}
